config/testing_client/root/sysbench/point_select_run_16.log
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 2349.64 qps: 2349.64 (r/w/o: 2349.64/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 2393.92 qps: 2393.92 (r/w/o: 2393.92/0.00/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 2063.34 qps: 2063.34 (r/w/o: 2063.34/0.00/0.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 2442.30 qps: 2442.30 (r/w/o: 2442.30/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 2559.39 qps: 2559.39 (r/w/o: 2559.39/0.00/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 2144.77 qps: 2144.77 (r/w/o: 2144.77/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 2584.63 qps: 2584.63 (r/w/o: 2584.63/0.00/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 2542.73 qps: 2542.73 (r/w/o: 2542.73/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 2439.69 qps: 2439.69 (r/w/o: 2439.69/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 2527.89 qps: 2527.89 (r/w/o: 2527.89/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1424.43 qps: 1424.43 (r/w/o: 1424.43/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 2471.25 qps: 2471.25 (r/w/o: 2471.25/0.00/0.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 2171.02 qps: 2171.02 (r/w/o: 2171.02/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 1970.10 qps: 1970.10 (r/w/o: 1970.10/0.00/0.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 1235.50 qps: 1235.50 (r/w/o: 1235.50/0.00/0.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 1926.16 qps: 1926.16 (r/w/o: 1926.16/0.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 2801.35 qps: 2801.35 (r/w/o: 2801.35/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 2181.55 qps: 2181.55 (r/w/o: 2181.55/0.00/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 3188.08 qps: 3188.08 (r/w/o: 3188.08/0.00/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 3109.12 qps: 3109.12 (r/w/o: 3109.12/0.00/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 2222.59 qps: 2222.59 (r/w/o: 2222.59/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 3261.79 qps: 3261.79 (r/w/o: 3261.79/0.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 3316.41 qps: 3316.41 (r/w/o: 3316.41/0.00/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 2914.37 qps: 2914.37 (r/w/o: 2914.37/0.00/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 2964.73 qps: 2964.73 (r/w/o: 2964.73/0.00/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 3223.40 qps: 3223.40 (r/w/o: 3223.40/0.00/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 2499.50 qps: 2499.50 (r/w/o: 2499.50/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 2842.72 qps: 2842.72 (r/w/o: 2842.72/0.00/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 2942.19 qps: 2942.19 (r/w/o: 2942.19/0.00/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 14 tps: 2522.29 qps: 2522.29 (r/w/o: 2522.29/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            752405
        write:                           0
        other:                           0
        total:                           752405
    transactions:                        752405 (2507.90 per sec.)
    queries:                             752405 (2507.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0123s
    total number of events:              752405

Latency (ms):
         min:                                    0.29
         avg:                                    6.38
         max:                                  217.40
         95th percentile:                       17.32
         sum:                              4797479.13

Threads fairness:
    events (avg/stddev):           47025.3125/188.12
    execution time (avg/stddev):   299.8424/0.02