config/testing_client/root/sysbench/point_select_run_16.log
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 2244.84 qps: 2244.84 (r/w/o: 2244.84/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 2758.98 qps: 2758.98 (r/w/o: 2758.98/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 2682.93 qps: 2682.93 (r/w/o: 2682.93/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 2658.86 qps: 2658.86 (r/w/o: 2658.86/0.00/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 2371.12 qps: 2371.12 (r/w/o: 2371.12/0.00/0.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 2648.41 qps: 2648.41 (r/w/o: 2648.41/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 2745.06 qps: 2745.06 (r/w/o: 2745.06/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 2696.22 qps: 2696.22 (r/w/o: 2696.22/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 2680.39 qps: 2680.39 (r/w/o: 2680.39/0.00/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 2778.51 qps: 2778.51 (r/w/o: 2778.51/0.00/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 2355.44 qps: 2355.44 (r/w/o: 2355.44/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 2692.44 qps: 2692.44 (r/w/o: 2692.44/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 2717.45 qps: 2717.45 (r/w/o: 2717.45/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 2724.80 qps: 2724.80 (r/w/o: 2724.80/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 2556.69 qps: 2556.69 (r/w/o: 2556.69/0.00/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 2575.31 qps: 2575.31 (r/w/o: 2575.31/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 2386.11 qps: 2386.21 (r/w/o: 2386.21/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 2652.40 qps: 2652.30 (r/w/o: 2652.30/0.00/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 2697.61 qps: 2697.61 (r/w/o: 2697.61/0.00/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 2701.79 qps: 2701.79 (r/w/o: 2701.79/0.00/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 2622.09 qps: 2622.09 (r/w/o: 2622.09/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 2542.31 qps: 2542.31 (r/w/o: 2542.31/0.00/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 2479.40 qps: 2479.40 (r/w/o: 2479.40/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 2716.01 qps: 2716.01 (r/w/o: 2716.01/0.00/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 2588.18 qps: 2588.18 (r/w/o: 2588.18/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 2631.23 qps: 2631.23 (r/w/o: 2631.23/0.00/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 2675.10 qps: 2675.20 (r/w/o: 2675.20/0.00/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 2708.88 qps: 2708.78 (r/w/o: 2708.78/0.00/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 2236.81 qps: 2236.81 (r/w/o: 2236.81/0.00/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 2204.84 qps: 2204.84 (r/w/o: 2204.84/0.00/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            777328
        write:                           0
        other:                           0
        total:                           777328
    transactions:                        777328 (2590.89 per sec.)
    queries:                             777328 (2590.89 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0192s
    total number of events:              777328

Latency (ms):
         min:                                    0.29
         avg:                                    6.17
         max:                                  376.85
         95th percentile:                       16.41
         sum:                              4797846.13

Threads fairness:
    events (avg/stddev):           48583.0000/111.09
    execution time (avg/stddev):   299.8654/0.00